; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared2 - mode
	thermograph4 - mode
	spectrograph3 - mode
	image0 - mode
	thermograph1 - mode
	image5 - mode
	Star1 - direction
	GroundStation4 - direction
	Star3 - direction
	Star2 - direction
	Star5 - direction
	GroundStation0 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star5)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star2)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image0)
	(supports instrument5 image5)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
)
(:goal (and
	(have_image Planet6 spectrograph3)
	(have_image Phenomenon7 image0)
	(have_image Star8 image0)
	(have_image Star8 infrared2)
	(have_image Phenomenon9 image0)
	(have_image Star10 image5)
	(have_image Star10 spectrograph3)
	(have_image Phenomenon11 image0)
	(have_image Phenomenon11 thermograph1)
))

)

; plan
1. (turn_to satellite0 star3 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star3)
   goals met: 0 of 9
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite0 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite0 phenomenon11 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon11)
   goals met: 0 of 9
5. (take_image satellite0 phenomenon11 instrument2 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 1 of 9
6. (take_image satellite0 phenomenon11 instrument2 image0)
   added: (have_image phenomenon11 image0)
   goals met: 2 of 9
7. (turn_to satellite0 groundstation0 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 9
8. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 2 of 9
9. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 2 of 9
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 9
11. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 2 of 9
12. (turn_to satellite0 planet6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet6)
   goals met: 2 of 9
13. (take_image satellite0 planet6 instrument0 spectrograph3)
   added: (have_image planet6 spectrograph3)
   goals met: 3 of 9
14. (turn_to satellite0 star10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star10)
   goals met: 3 of 9
15. (take_image satellite0 star10 instrument0 spectrograph3)
   added: (have_image star10 spectrograph3)
   goals met: 4 of 9
16. (turn_to satellite0 star8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star8)
   goals met: 4 of 9
17. (take_image satellite0 star8 instrument0 infrared2)
   added: (have_image star8 infrared2)
   goals met: 5 of 9
18. (turn_to satellite1 groundstation0 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation0)
   goals met: 5 of 9
19. (calibrate satellite1 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 5 of 9
20. (turn_to satellite1 phenomenon7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon7)
   goals met: 5 of 9
21. (take_image satellite1 phenomenon7 instrument5 image0)
   added: (have_image phenomenon7 image0)
   goals met: 6 of 9
22. (turn_to satellite1 phenomenon9 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon9)
   goals met: 6 of 9
23. (take_image satellite1 phenomenon9 instrument5 image0)
   added: (have_image phenomenon9 image0)
   goals met: 7 of 9
24. (turn_to satellite1 star10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star10)
   goals met: 7 of 9
25. (take_image satellite1 star10 instrument5 image5)
   added: (have_image star10 image5)
   goals met: 8 of 9
26. (turn_to satellite1 star8 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star8)
   goals met: 8 of 9
27. (take_image satellite1 star8 instrument5 image0)
   added: (have_image star8 image0)
   goals met: 9 of 9
